'=======Set========'
# Set - множества - изменяемый, неупорядоченный, итерируемый, неиндексируемый тип данных, предназначенный для хранения уникальных значений.
# Множества могут хранить в себе только низменяемые типы данных, если же в set использовать tuple, то внутри tuple не должно быть изменяемого типа данных.

#set1 ={1,5,3,4,True,'hello',None} 
#print(set1) #{1, 3, 4, 5, 'hello', None}

#set2 = {1,2,3,('hello',1,[1,2])}
#print(set2)# ошибка потому что мы засунули изменяеые типы данных 

'=============FIFO/LIFO==========='
# FIFO - first in first out
# LIFO - last in first out

#set_={1,2,3,4,2}
#print(set_)

